### android知识问答
在android（以下简称a）开发中现在使用的主流开发语言是java.（以下简称j）
### 1
- 1.1
Q.j是面相对象的编程语言是否能简单按照自己的理解简述一下面向对象的含义.
A.在编程过程中我们把每个需求分析后，除了整个需求作为一个对象，每个需求的细节也都分解成一个个相互依赖的对象，在技术实现过程中每个类、方法也都可以看作一个一个的对象，这些对象有继承的父子关系，有开放接口的相互调用关系，每个对象都专注于处理自己的业务逻辑，就如同一个个齿轮一样可以独立运转也可以相互关联，从而形成我们程序
- 1.2
Q.普通类、抽象类、接口 有什么异同.
A.普通类class 与 abstract class ac可以声明抽象方法，ac与interface 接口只做声明，而ac可只做声明也可以实现
### 2
- 2.1
Q.进程与线程的区别
A.在一个系统中一般的情况下我们每个程序都是一个进程，一个进程中可以开启多个线程
- 2.2
Q.在a中的进程与线程又是什么样的
A.在a中我们每开启一个app系统都会启动一个进程，当进程被开启后会默认开启一个主线程这个线程也被称为ui线程，程序中所有的ui更新都会在这个线程中运行，这个线程中无法做耗时的操作，如果有耗时操作，需要另外开启线程.
- 2.3
Q.如何开启线程，是否能简单描述有哪几种现在接触过的线程开启方式
A.可以在activity中使用new rannble实现run方法，在new thread 中开启rannble，也可以继承thread实现run方法并且调用start方法
或者利用new一个线程池的方式开启
- 2.4
Q.a中进程的生命周期是什么样的
A.TODO：
### 3
- 3.1
Q.j中list和hasmap分别在什么情况下使用
A.当我们需要在列表中添加数据的时候我们可以始终arraylist.当需要对列表的数据做查询的时候可以使用hasmap
- 3.2
Q.j中什么时候我们可以使用范型有什么好处？
A.当我们需要规范数据格式是可以使用范型，并且在对base class做抽象的时候可以使用T，R两张模式做抽象
- 3.3
Q.j中注解的使用，有哪几种注解
A.TODO：
- 3.4
Q.简述j中反射的机制
A.TODO：
### 4
- 4.1
Q.a中四大组件分别是什么
A.activity、broadcast receiver、service、content provider
- 4.2
Q.activity的入栈方式有哪几种
A.默认的栈内多任务、栈顶唯一，栈内唯一，多栈唯一
- 4.3
Q.activity生命周期
A.onCereate,onRestart,onStart,onResume,onPause,onStop,onDestory
- 4.4
